app/controllers/v2/fuests_controller.rb

    def index
    limit = params[:limit] || 1
    difficulties = params[:difficulties] || 'hard'


    fuests = Fuest.where(difficulty: difficulties).order('RANDOM()').limit(limit)
---
SELECT "fuests".* FROM "fuests" WHERE "fuests"."difficulty" = $1 ORDER BY RANDOM() LIMIT $2  [["difficulty", "easy"], ["LIMIT", 1]]